[
  {
    "id": "atlas-games-launch",
    "slug": "atlas-games-launch",
    "title": "Welcome to Atlas Games: Our Journey Begins",
    "author": "Luke Rall",
    "date": "2024-08-01",
    "excerpt": "After months of preparation, we're excited to officially launch Atlas Games and share our vision for creating games that truly endure.",
    "content": "<p>Welcome to Atlas Games! We're thrilled to finally share our studio with the world and introduce you to our mission: creating games built to endure.</p><p>Founded by three passionate game developers, Atlas Games represents our commitment to crafting experiences that stand the test of time. Like Atlas holding up the heavens, we believe games should support and enrich the lives of players for years to come.</p><p>Our approach focuses on three core pillars:</p><ul><li><strong>Craft:</strong> Every game we create is meticulously designed with attention to detail and player experience.</li><li><strong>Community:</strong> We build games that bring people together and foster lasting connections.</li><li><strong>Longevity:</strong> Our games are designed to remain engaging and relevant long after their initial release.</li></ul><p>Stay tuned for exciting announcements about our upcoming releases and behind-the-scenes looks at our development process!</p>",
    "coverImage": "assets/images/blog/atlas-launch-cover.jpg",
    "tags": ["Studio News", "Launch", "Vision"]
  },
  {
    "id": "wobbly-wiggles-3-release",
    "slug": "wobbly-wiggles-3-ultimate-racers-release",
    "title": "Wobbly Wiggles 3: Ultimate Racers - Diamond & Onyx Editions Now Available!",
    "author": "Keagan Du Plessis",
    "date": "2024-11-20",
    "excerpt": "The highly anticipated third installment in the Wobbly Wiggles series has arrived, bringing physics-based racing to new heights with two premium editions.",
    "content": "<p>We're incredibly excited to announce that Wobbly Wiggles 3: Ultimate Racers is now available in both Diamond and Onyx editions!</p><p>This latest entry in our beloved Wobbly Wiggles franchise takes the series in an exciting new direction, combining the signature wobbly physics gameplay with high-speed racing action. The result is an experience that's both familiar to series fans and refreshingly innovative.</p><h3>What's New in Ultimate Racers</h3><p>Ultimate Racers introduces vehicle-based gameplay while maintaining the chaotic, physics-driven fun that made the series popular. Players can customize their wobbly vehicles, compete on multiple tracks, and experience racing like never before.</p><h3>Diamond vs Onyx Editions</h3><p>The Diamond Edition includes the full racing experience with exclusive content and tracks. The Onyx Edition goes even further, adding premium vehicle skins, VIP tournament access, and additional customization options.</p><p>Both editions represent months of careful development and playtesting to ensure they meet the high standards our community expects from Atlas Games.</p>",
    "coverImage": "assets/images/blog/wobbly-3-release-cover.jpg",
    "tags": ["Game Release", "Wobbly Wiggles", "Racing"]
  },
  {
    "id": "indie-game-development-philosophy",
    "slug": "indie-game-development-philosophy",
    "title": "Our Philosophy on Indie Game Development",
    "author": "Liam Schultz",
    "date": "2024-07-15",
    "excerpt": "A deep dive into our development philosophy and how we balance creativity, technical excellence, and player satisfaction in every project.",
    "content": "<p>As an indie studio, we have the unique opportunity to create games exactly as we envision them, without the constraints often imposed by larger publishers. But with this freedom comes great responsibility.</p><p>Our development philosophy centers around several key principles that guide every decision we make:</p><h3>Player-First Design</h3><p>Every feature, every mechanic, every visual element is evaluated through the lens of player experience. We ask ourselves: 'Does this make the game more enjoyable? Does it serve the player's journey?'</p><h3>Technical Excellence</h3><p>We believe that good code is the foundation of good games. Clean, efficient programming not only makes our games run better but also allows us to iterate faster and implement new features more reliably.</p><h3>Sustainable Development</h3><p>We've learned that crunch culture doesn't produce better games—it produces burnout. Our team works sustainable hours, takes breaks when needed, and maintains a healthy work-life balance. This approach actually leads to more creative and innovative solutions.</p><h3>Community Feedback</h3><p>Our players are our partners in development. We actively seek feedback during development and post-launch, using it to refine our games and plan future updates.</p><p>These principles have guided us through the development of all our titles, from the original Wobbly Wiggles to our upcoming releases.</p>",
    "coverImage": "assets/images/blog/dev-philosophy-cover.jpg",
    "tags": ["Development", "Philosophy", "Indie Games"]
  },
  {
    "id": "harvest-hustle-postmortem",
    "slug": "harvest-hustle-development-postmortem",
    "title": "Harvest Hustle: A Development Postmortem",
    "author": "Luke Rall",
    "date": "2024-04-10",
    "excerpt": "Looking back at the development of Harvest Hustle, from initial concept to release, and the lessons we learned along the way.",
    "content": "<p>Harvest Hustle was one of our most ambitious projects to date, combining farming simulation with intense time management gameplay. Now that the game has been out for a few months, it's time to reflect on the development process and share what we learned.</p><h3>The Initial Concept</h3><p>The idea for Harvest Hustle came from our desire to create a farming game that felt more dynamic and urgent than traditional titles in the genre. We wanted to capture the peaceful satisfaction of farming while adding excitement through time pressure and resource management.</p><h3>Development Challenges</h3><p>One of our biggest challenges was balancing the relaxing nature of farming with the stress of time management. Early playtests showed that players either found the game too stressful or too easy, with little middle ground.</p><p>We solved this by implementing multiple difficulty levels and a dynamic difficulty system that adjusts based on player performance. This allows both casual and hardcore players to enjoy the experience at their preferred level of challenge.</p><h3>What Went Right</h3><ul><li>The art style resonated strongly with players</li><li>The core gameplay loop proved addictive and engaging</li><li>Our iterative development process allowed for rapid improvements</li><li>Community feedback helped shape the final product</li></ul><h3>What We'd Do Differently</h3><ul><li>Start playtesting earlier in development</li><li>Implement analytics sooner to better understand player behavior</li><li>Plan for post-launch content updates from the beginning</li></ul><p>Overall, Harvest Hustle taught us valuable lessons about balancing accessibility with depth, and these lessons continue to inform our current projects.</p>",
    "coverImage": "assets/images/blog/harvest-hustle-postmortem-cover.jpg",
    "tags": ["Postmortem", "Harvest Hustle", "Development"]
  },
  {
    "id": "upcoming-projects-2025",
    "slug": "upcoming-projects-2025-preview",
    "title": "2025 Preview: What's Coming from Atlas Games",
    "author": "Luke Rall",
    "date": "2024-12-15",
    "excerpt": "Get a sneak peek at our exciting lineup of games coming in 2025, including Timmy's Revenge, From The Shadows, and more.",
    "content": "<p>As we approach 2025, we're excited to share a preview of the amazing projects we have in development. This year promises to be our biggest yet, with several major releases planned across multiple genres.</p><h3>Timmy's Revenge (Q2 2025)</h3><p>Our upcoming 2D platformer is shaping up to be something special. Timmy's Revenge combines tight platforming controls with hand-drawn animations and a compelling story of justice and redemption. We're putting extra effort into making sure the game feels responsive and satisfying to play.</p><h3>From The Shadows (Q3 2025)</h3><p>This atmospheric horror game represents a new direction for Atlas Games. We're exploring psychological horror through environmental storytelling and stealth-based gameplay. Early feedback from internal testing has been incredibly positive.</p><h3>Cancer Crusher (Q2 2025)</h3><p>Perhaps our most meaningful project, Cancer Crusher combines engaging puzzle gameplay with educational content about cancer awareness and prevention. We're working closely with medical professionals to ensure accuracy while maintaining an empowering and hopeful tone.</p><h3>CapsuleWars Beta</h3><p>Our strategic battle game is entering beta testing in early 2025. We're looking for players who enjoy deep strategy games to help us refine the balance and mechanics.</p><p>Each of these projects represents our commitment to creating diverse, high-quality gaming experiences. We can't wait to share more details as development progresses!</p>",
    "coverImage": "assets/images/blog/2025-preview-cover.jpg",
    "tags": ["Preview", "2025", "Upcoming Games"]
  }
]

